<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="3" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="input_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="attention_mask" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<rt_info>
				<attribute name="fused_names" version="0" value="position_ids" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="beam_idx" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.model.embed_tokens.weight_compressed" type="Const" version="opset1">
			<data element_type="u8" shape="152064, 5120" offset="0" size="778567680" />
			<rt_info>
				<attribute name="fused_names" version="0" value="self.model.embed_tokens.weight_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="U8">
					<dim>152064</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.model.embed_tokens/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model.embed_tokens/aten::embedding/Convert" />
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="__module.model.embed_tokens/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="778567680" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model.embed_tokens/aten::embedding/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="7" name="self.model.embed_tokens.weight_compressed/scale" type="Const" version="opset1">
			<data element_type="f16" shape="152064, 1" offset="778567684" size="304128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="self.model.embed_tokens.weight_compressed/scale" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>152064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Convert_377313" type="Const" version="opset1">
			<data element_type="f16" shape="152064, 1" offset="778871812" size="304128" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_377313, self.model.embed_tokens.weight_compressed/zero_point" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>152064</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="__module.model.embed_tokens/aten::embedding/Gather" type="GatherCompressed" version="ie_internal_opset">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Convert_377310, Convert_377313, __module.model.embed_tokens/aten::embedding/Constant, __module.model.embed_tokens/aten::embedding/Convert, __module.model.embed_tokens/aten::embedding/Gather, self.model.embed_tokens.weight, self.model.embed_tokens.weight_compressed, self.model.embed_tokens.weight_compressed/fq_weights_0, self.model.embed_tokens.weight_compressed/scale, self.model.embed_tokens.weight_compressed/zero_point, self.model.embed_tokens.weight_compressed/zero_point/subtract" />
			</rt_info>
			<input>
				<port id="0" precision="U8">
					<dim>152064</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
				<port id="3" precision="FP16">
					<dim>152064</dim>
					<dim>1</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>152064</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16" names="375,431,442,hidden_states.1,hidden_states.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="__module.model.embed_tokens/aten::embedding/Gather_decompressed_to_f32" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model.embed_tokens/aten::embedding/Gather" />
				<attribute name="precise" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_232210" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 5120" offset="779175940" size="20480" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_232210, Constant_232210_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.model.layers.0.input_layernorm/aten::mul/Multiply_1_compressed_to_f16" type="RMS" version="ie_internal_opset">
			<data epsilon="1.0132789611816406e-06" output_type="f16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_232207, Constant_232207_compressed, Constant_232208, Constant_232208_compressed, Constant_232210, Constant_232210_compressed, Constant_380, __module.model.embed_tokens/aten::embedding/Gather, __module.model.layers.0.input_layernorm/aten::add/Add, __module.model.layers.0.input_layernorm/aten::mean/ReduceMean, __module.model.layers.0.input_layernorm/aten::mul/Multiply, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.input_layernorm/aten::pow/Power, __module.model.layers.0.input_layernorm/aten::rsqrt/Divide, __module.model.layers.0.input_layernorm/aten::rsqrt/Sqrt" />
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_250364_fused" type="Const" version="opset1">
			<data element_type="i4" shape="15360, 5120" offset="779196420" size="39321600" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_377323, Constant_377330, Constant_377337, Convert_377319, Convert_377326, Convert_377333, Placeholder_245217, Placeholder_245220, Placeholder_245223, Reshape_377324, Reshape_377331, Reshape_377338, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.self_attn.k_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.q_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.v_proj/aten::linear/MatMul, self.model.layers.0.self_attn.k_proj.weight, self.model.layers.0.self_attn.k_proj.weight_compressed, self.model.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.k_proj.weight_compressed/scale, self.model.layers.0.self_attn.q_proj.weight, self.model.layers.0.self_attn.q_proj.weight_compressed, self.model.layers.0.self_attn.q_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.q_proj.weight_compressed/scale, self.model.layers.0.self_attn.v_proj.weight, self.model.layers.0.self_attn.v_proj.weight_compressed, self.model.layers.0.self_attn.v_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.v_proj.weight_compressed/scale" />
			</rt_info>
			<output>
				<port id="0" precision="I4">
					<dim>15360</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_307773" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="818518020" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_307774" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="818518028" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="VariadicSplit_307775" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="I4">
					<dim>15360</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I4">
					<dim>7680</dim>
					<dim>5120</dim>
				</port>
				<port id="4" precision="I4">
					<dim>7680</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Placeholder_256071" type="Placeholder" version="gpu_opset">
			<rt_info>
				<attribute name="fused_names" version="0" value="Placeholder_256071" />
			</rt_info>
			<output>
				<port id="0" precision="UNSPECIFIED" />
			</output>
		</layer>
		<layer id="18" name="Constant_250363_fused" type="Const" version="opset1">
			<data element_type="f16" shape="15360, 40" offset="818518044" size="1228800" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_377323, Constant_377330, Constant_377337, Convert_377319, Convert_377326, Convert_377333, Placeholder_245217, Placeholder_245220, Placeholder_245223, Reshape_377324, Reshape_377331, Reshape_377338, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.self_attn.k_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.q_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.v_proj/aten::linear/MatMul, self.model.layers.0.self_attn.k_proj.weight, self.model.layers.0.self_attn.k_proj.weight_compressed, self.model.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.k_proj.weight_compressed/scale, self.model.layers.0.self_attn.q_proj.weight, self.model.layers.0.self_attn.q_proj.weight_compressed, self.model.layers.0.self_attn.q_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.q_proj.weight_compressed/scale, self.model.layers.0.self_attn.v_proj.weight, self.model.layers.0.self_attn.v_proj.weight_compressed, self.model.layers.0.self_attn.v_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.v_proj.weight_compressed/scale" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>15360</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_307776" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="818518028" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="VariadicSplit_307777" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>15360</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>7680</dim>
					<dim>40</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>7680</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="__module.model.layers.0.self_attn.q_proj/aten::linear/MatMul_fused" type="FullyConnectedCompressed" version="gpu_opset">
			<data output_type="f16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_377323, Constant_377330, Constant_377337, Convert_377319, Convert_377326, Convert_377333, Placeholder_245217, Placeholder_245220, Placeholder_245223, Reshape_377324, Reshape_377331, Reshape_377338, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.self_attn.k_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.q_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.v_proj/aten::linear/MatMul, self.model.layers.0.self_attn.k_proj.weight, self.model.layers.0.self_attn.k_proj.weight_compressed, self.model.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.k_proj.weight_compressed/scale, self.model.layers.0.self_attn.q_proj.weight, self.model.layers.0.self_attn.q_proj.weight_compressed, self.model.layers.0.self_attn.q_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.q_proj.weight_compressed/scale, self.model.layers.0.self_attn.v_proj.weight, self.model.layers.0.self_attn.v_proj.weight_compressed, self.model.layers.0.self_attn.v_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.v_proj.weight_compressed/scale" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="I4">
					<dim>7680</dim>
					<dim>5120</dim>
				</port>
				<port id="2" precision="UNSPECIFIED" />
				<port id="3" precision="FP16">
					<dim>7680</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>7680</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="__module.model.layers.0.self_attn.q_proj/aten::linear/MatMul_fused_TP" type="SYNCTENSOR" version="gpu_opset">
			<data output_type="f16" />
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>7680</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>7680</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>7680</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.model.layers.0.self_attn.q_proj/aten::linear/MatMul_fused_ALLGATHER" type="Concat" version="opset1">
			<data axis="-1" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_377323, Constant_377330, Constant_377337, Convert_377319, Convert_377326, Convert_377333, Placeholder_245217, Placeholder_245220, Placeholder_245223, Reshape_377324, Reshape_377331, Reshape_377338, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.self_attn.k_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.q_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.v_proj/aten::linear/MatMul, self.model.layers.0.self_attn.k_proj.weight, self.model.layers.0.self_attn.k_proj.weight_compressed, self.model.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.k_proj.weight_compressed/scale, self.model.layers.0.self_attn.q_proj.weight, self.model.layers.0.self_attn.q_proj.weight_compressed, self.model.layers.0.self_attn.q_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.q_proj.weight_compressed/scale, self.model.layers.0.self_attn.v_proj.weight, self.model.layers.0.self_attn.v_proj.weight_compressed, self.model.layers.0.self_attn.v_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.v_proj.weight_compressed/scale" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>7680</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>7680</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>15360</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_256075" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="819746844" size="8" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_377323, Constant_377330, Constant_377337, Convert_377319, Convert_377326, Convert_377333, Placeholder_245217, Placeholder_245220, Placeholder_245223, Reshape_377324, Reshape_377331, Reshape_377338, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.self_attn.k_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.q_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.v_proj/aten::linear/MatMul, self.model.layers.0.self_attn.k_proj.weight, self.model.layers.0.self_attn.k_proj.weight_compressed, self.model.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.k_proj.weight_compressed/scale, self.model.layers.0.self_attn.q_proj.weight, self.model.layers.0.self_attn.q_proj.weight_compressed, self.model.layers.0.self_attn.q_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.q_proj.weight_compressed/scale, self.model.layers.0.self_attn.v_proj.weight, self.model.layers.0.self_attn.v_proj.weight_compressed, self.model.layers.0.self_attn.v_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.v_proj.weight_compressed/scale" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_256076" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="819746852" size="24" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_377323, Constant_377330, Constant_377337, Convert_377319, Convert_377326, Convert_377333, Placeholder_245217, Placeholder_245220, Placeholder_245223, Reshape_377324, Reshape_377331, Reshape_377338, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.self_attn.k_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.q_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.v_proj/aten::linear/MatMul, self.model.layers.0.self_attn.k_proj.weight, self.model.layers.0.self_attn.k_proj.weight_compressed, self.model.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.k_proj.weight_compressed/scale, self.model.layers.0.self_attn.q_proj.weight, self.model.layers.0.self_attn.q_proj.weight_compressed, self.model.layers.0.self_attn.q_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.q_proj.weight_compressed/scale, self.model.layers.0.self_attn.v_proj.weight, self.model.layers.0.self_attn.v_proj.weight_compressed, self.model.layers.0.self_attn.v_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.v_proj.weight_compressed/scale" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.layers.0.self_attn.q_proj/aten::linear/MatMul_split" type="VariadicSplit" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_377323, Constant_377330, Constant_377337, Convert_377319, Convert_377326, Convert_377333, Placeholder_245217, Placeholder_245220, Placeholder_245223, Reshape_377324, Reshape_377331, Reshape_377338, __module.model.layers.0.input_layernorm/aten::mul/Multiply_1, __module.model.layers.0.self_attn.k_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.q_proj/aten::linear/MatMul, __module.model.layers.0.self_attn.v_proj/aten::linear/MatMul, self.model.layers.0.self_attn.k_proj.weight, self.model.layers.0.self_attn.k_proj.weight_compressed, self.model.layers.0.self_attn.k_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.k_proj.weight_compressed/scale, self.model.layers.0.self_attn.q_proj.weight, self.model.layers.0.self_attn.q_proj.weight_compressed, self.model.layers.0.self_attn.q_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.q_proj.weight_compressed/scale, self.model.layers.0.self_attn.v_proj.weight, self.model.layers.0.self_attn.v_proj.weight_compressed, self.model.layers.0.self_attn.v_proj.weight_compressed/fq_weights_1, self.model.layers.0.self_attn.v_proj.weight_compressed/scale" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>15360</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
				<port id="5" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_232211_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 5120" offset="819746876" size="10240" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_232211, Constant_232211_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.layers.0.self_attn.q_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model.layers.0.self_attn.q_proj/aten::linear/Add" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="452,query_states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_244566" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="819757116" size="16" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_244566" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.model.layers.0.self_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model.layers.0.self_attn/aten::view/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16" names="460">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>40</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="self.model.layers.0.self_attn.rotary_emb.cos_cached_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32768, 128" offset="819757132" size="8388608" />
			<rt_info>
				<attribute name="fused_names" version="0" value="self.model.layers.0.self_attn.rotary_emb.cos_cached, self.model.layers.0.self_attn.rotary_emb.cos_cached_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16" names="self.model.layers.0.self_attn.rotary_emb.cos_cached">
					<dim>32768</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="self.model.layers.0.self_attn.rotary_emb.sin_cached_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32768, 128" offset="828145740" size="8388608" />
			<rt_info>
				<attribute name="fused_names" version="0" value="self.model.layers.0.self_attn.rotary_emb.sin_cached, self.model.layers.0.self_attn.rotary_emb.sin_cached_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16" names="self.model.layers.0.self_attn.rotary_emb.sin_cached">
					<dim>32768</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Convert_207338" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.model/prim::ListConstruct/Reshape" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="836534348" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model/prim::ListConstruct/Reshape" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="ShapeOf_167597" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Constant_285907, Constant_285909, Gather_240524, Gather_285910, ShapeOf_240521, ShapeOf_285905" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>5120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_167598" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="836534352" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Gather_240524, ShapeOf_240521" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="37" name="Constant_167599" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="778567680" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Gather_240524, ShapeOf_240521" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="38" name="Gather_167600" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Constant_285907, Constant_285909, Convert_241167, Gather_240524, Gather_285910, ShapeOf_240521, ShapeOf_285905" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="1035,1176,1317,1458,1599,1740,1881,2022,2163,2304,2445,2586,2727,2868,3009,3150,3291,3432,3573,364,3714,3855,3996,4137,4278,4419,4560,468,4701,4842,4983,5124,5265,5406,5547,5688,5829,5970,612,753,894" />
			</output>
		</layer>
		<layer id="39" name="Constant_167602" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="836534352" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Constant_240526, Gather_240524, Reshape_240527, ShapeOf_240521, Unsqueeze_240439, __module.model.layers.0.self_attn.rotary_emb/aten::slice/Constant" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Reshape_167603" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Constant_240526, Constant_285907, Constant_285909, Convert_241167, Gather_240524, Gather_285910, Reshape_240527, ShapeOf_240521, ShapeOf_285905, Unsqueeze_240439, __module.model.layers.0.self_attn.rotary_emb/aten::slice/Constant" />
			</rt_info>
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.model/prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Constant_240526, Constant_285907, Constant_285909, Convert_241167, Gather_240524, Gather_285910, Reshape_240527, ShapeOf_240521, ShapeOf_285905, Unsqueeze_240439, __module.model.layers.0.self_attn.rotary_emb/aten::slice/Constant, __module.model/prim::ListConstruct/Concat, __module.model/prim::ListConstruct/Reshape" />
				<attribute name="precise" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="371">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.model/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model.layers.0.self_attn/aten::index/Convert, __module.model/aten::view/Reshape" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32" names="372,373,position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.layers.0.self_attn/aten::add/Add" type="RoPE" version="ie_internal_opset">
			<data config.slice_start="0" config.slice_stop="0" config.input_trans0213="true" config.is_interleaved="false" config.rotary_ndims="128" config.is_chatglm="false" config.is_qwen="false" config.head_cnt="0" config.head_size="0" config.gather_position_arg_id="3" />
			<rt_info>
				<attribute name="fused_names" version="0" value="__module.model.layers.0.self_attn/aten::add/Add, __module.model.layers.0.self_attn/aten::cat/Concat, __module.model.layers.0.self_attn/aten::mul/Multiply, __module.model.layers.0.self_attn/aten::mul/Multiply_1, __module.model.layers.0.self_attn/aten::neg/Multiply" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>40</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32768</dim>
					<dim>128</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>32768</dim>
					<dim>128</dim>
				</port>
				<port id="3" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP16" names="505">
					<dim>-1</dim>
					<dim>40</dim>
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_285919_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="836534356" size="2" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_285919, Constant_285919_compressed" />
			</rt_info>
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="45" name="Constant_167616" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="778567680" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_285907, Constant_285909, Gather_285910, ShapeOf_285905" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_167617" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="778567680" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_285907, Constant_285909, Gather_285910, ShapeOf_285905" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="47" name="Gather_167618" type="Gather" version="opset8">
			<data batch_dims="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_240522, Constant_240523, Constant_285907, Constant_285909, Gather_240524, Gather_285910, ShapeOf_240521, ShapeOf_285905" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_285912" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="836534358" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_285912" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_285914" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="778567680" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_285914" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_285916" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="836534362" size="4" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_285916" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Concat_285917" type="Concat" version="opset1">
			<data axis="0" />
			<rt_info>
				<attribute name="fused_names" version="0" value="Concat_285917, Concat_285930, Concat_285943, Concat_285956, Concat_285969, Concat_285982, Concat_285995, Concat_286008, Concat_286021, Concat_286034, Concat_286047, Concat_286060, Concat_286073, Concat_286086, Concat_286099, Concat_286112, Concat_286125, Concat_286138, Concat_286151, Concat_286164, Concat_286177, Concat_286190, Concat_286203, Concat_286216, Concat_286229, Concat_286242, Concat_286255, Concat_286268, Concat_286281, Concat_286294, Concat_286307, Concat_286320, Concat_286333, Concat_286346, Concat_286359, Concat_286372, Concat_286385, Concat_286398, Concat_286411, Concat_286424, Concat_286437, Concat_286450, Concat_286463, Concat_286476, Concat_286489, Concat_286502, Concat_286515, Concat_286528, Concat_286541, Concat_286554, Concat_286567, Concat_286580, Concat_286593, Concat_286606, Concat_286619, Concat_286632, Concat_286645, Concat_286658, Concat_286671, Concat_286684, Concat_286697, Concat_286710, Concat_286723, Concat_286736, Concat_286749, Concat_286762, Concat_286775, Concat_286788, Concat_286801, Concat_286814, Concat_286827, Concat_286840, Concat_286853, Concat_286866, Concat_286879, Concat_286892, Concat_286905, Concat_286918, Concat_286931, Concat_286944, Constant_240522, Constant_240523, Constant_285907, Constant_285909, Constant_285912, Constant_285914, Constant_285916, Constant_285925, Constant_285927, Constant_285929, Constant_285938, Constant_285940, Constant_285942, Constant_285951, Constant_285953, Constant_285955, Constant_285964, Constant_285966, Constant_285968, Constant_285977, Constant_285979, Constant_285981, Constant_285990, Constant_285992, Constant_285994, Constant_286003, Constant_286005, Constant_286007, Constant_286016, Constant_286018, Constant_286020, Constant_286029, Constant_286031, Constant_286033, Constant_286042, Constant_286044, Constant_286046, Constant_286055, Constant_286057, Constant_286059, Constant_286068, Constant_286070, Constant_286072, Constant_286081, Constant_286083, Constant_286085, Constant_286094, Constant_286096, Constant_286098, Constant_286107, Constant_286109, Constant_286111, Constant_286120, Constant_286122, Constant_286124, Constant_286133, Constant_286135, Constant_286137, Constant_286146, Constant_286148, Constant_286150, Constant_286159, Constant_286161, Constant_286163, Constant_286172, Constant_286174, Constant_286176, Constant_286185, Constant_286187, Constant_286189, Constant_286198, Constant_286200, Constant_286202, Constant_286211, Constant_286213, Constant_286215, Constant_286224, Constant_286226, Constant_286228, Constant_286237, Constant_286239, Constant_286241, Constant_286250, Constant_286252, Constant_286254, Constant_286263, Constant_286265, Constant_286267, Constant_286276, Constant_286278, Constant_286280, Constant_286289, Constant_286291, Constant_286293, Constant_286302, Constant_286304, Constant_286306, Constant_286315, Constant_286317, Constant_286319, Constant_286328, Constant_286330, Constant_286332, Constant_286341, Constant_286343, Constant_286345, Constant_286354, Constant_286356, Constant_286358, Constant_286367, Constant_286369, Constant_286371, Constant_286380, Constant_286382, Constant_286384, Constant_286393, Constant_286395, Constant_286397, Constant_286406, Constant_286408, Constant_286410, Constant_286419, Constant_286421, Constant_286423, Constant_286432, Constant_286434, Constant_286436, Constant_286445, Constant_286447, Constant_286449, Constant_286458, Constant_286460, Constant_286462, Constant_286471, Constant_286473, Constant_286475, Constant_286484, Constant_286486, Constant_286488, Constant_286497, Constant_286499, Constant_286501, Constant_286510, Constant_286512, Constant_286514, Constant_286523, Constant_286525, Constant_286527, Constant_286536, Constant_286538, Constant_286540, Constant_286549, Constant_286551, Constant_286553, Constant_286562, Constant_286564, Constant_286566, Constant_286575, Constant_286577, Constant_286579, Constant_286588, Constant_286590, Constant_286592, Constant_286601, Constant_286603, Constant_286605, Constant_286614, Constant_286616, Constant_286618, Constant_286627, Constant_286629, Constant_286631, Constant_286640, Constant_286642, Constant_286644, Constant_286653, Constant_286655, Constant_286657, Constant_286666, Constant_286668, Constant_286670, Constant_286679, Constant_286681, Constant_286683, Constant_286692, Constant_286694, Constant_286696, Constant_286705, Constant_286707, Constant_286709, Constant_286718, Constant_286720, Constant_286722, Constant_286731, Constant_286733, Constant_286735, Constant_286744, Constant_286746, Constant_286748, Constant_286757, Constant_286759, Constant_286761, Constant_286770, Constant_286772, Constant_286774, Constant_286783, Constant_286785, Constant_286787, Constant_286796, Constant_286798, Constant_286800, Constant_286809, Constant_286811, Constant_286813, Constant_286822, Constant_286824, Constant_286826, Constant_286835, Constant_286837, Constant_286839, Constant_286848, Constant_286850, Constant_286852, Constant_286861, Constant_286863, Constant_286865, Constant_286874, Constant_286876, Constant_286878, Constant_286887, Constant_286889, Constant_286891, Constant_286900, Constant_286902, Constant_286904, Constant_286913, Constant_286915, Constant_286917, Constant_286926, Constant_286928, Constant_286930, Constant_286939, Constant_286941, Constant_286943, Gather_240524, Gather_285910, ShapeOf_240521, ShapeOf_285905" />
				<attribute name="precise" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Broadcast_285920" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<rt_info>
